Terraform plan for __ibo__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.label_generator_service_account_iam[0] will be created
  + resource "google_project_iam_member" "label_generator_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/datastore.user"
    }

  # google_service_account.label_generator_bucket_access_sa will be created
  + resource "google_service_account" "label_generator_bucket_access_sa" {
      + account_id   = "****************"
      + disabled     = false
      + display_name = "Service account for uploading label_generator files"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.label_generator_service_account will be created
  + resource "google_service_account_iam_member" "label_generator_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ibo-prod.svc.id.goog[ebo/ebo-sel-services]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket_iam_member.label_generator_service_account_iam will be created
  + resource "google_storage_bucket_iam_member" "label_generator_service_account_iam" {
      + bucket = "shelf-edge-labels-prod"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # kubernetes_service_account.label_generator_service_account will be created
  + resource "kubernetes_service_account" "label_generator_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "ebo-sel-services"
          + namespace        = "ebo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #403](https://github.com/ebomart/commerce-infrastructure/actions/runs/1711551000)